Repository: City-busz/ImCompressor
Catalog: po/*.po
Languages: az, he

source: Compress your images
az: Şəkillərinizi sıxışdırın
he: דחיסת התמונות שלך

source: Optimize your images with Curtail, a useful image compressor that supports PNG, JPEG, WebP and SVG file types.
az: PNG, JPEG, WebP və SVG fayl növlərini dəstəkləyən faydalı şəkil sıxışdırıcı Curtail ilə şəkillərinizi optimallaşdırın.
he: אפשר למטב את התמונות שלך עם Curtail, דוחס תמונות שימושי שתומך בסוגי הקבצים PNG,‏ JPEG,‏ WebP ו־SVG.

source: It supports both lossless and lossy compression modes with an option to whether keep or not metadata of images.
az: Şəkillərin metadatasını saxlamaq və ya saxlamamaq seçimi ilə həm itkisiz, həm də itkili sıxışdırma rejimlərini dəstəkləyir.
he: תומך במצבי דחיסה עם ובלי אובדן איכות לרבות אפשרות לשמור נתוני על של תמונות.

source: Hugo Posnic
he: הוגו פוסניק

source: compress;optimize;image;photo;
he: דחיסה;תמונה;צילום;תצלום;מיטוב;אפטום;איפטום;אופטמיזציה;

source: Save into a new file
az: Yeni fayla saxla
he: שמירה לקובץ חדש

source: Save the compressed image into a new file.
az: Sıxışdırılmış şəkli yeni fayla saxla.
he: שמירת הקובץ הדחוס לקובץ חדש.

source: Select the mode to append text for a new file
az: Yeni fayl üçün mətn əlavə etmə rejimini seçin
he: נא לבחור מצב כדי להוסיף טקסט לקובץ חדש

source: Set how to append the additional text (as suffix or prefix) for a new file.
az: Yeni fayl üçün əlavə mətnin (suffiks və ya prefiks kimi) necə əlavə ediləcəyini təyin edin.
he: להגדיר איך להוסיף את הטקסט (כקידומת או כסיומת) לקובץ חדש.

source: Enable recursive compression in folders
az: Qovluqlarda rekursiv sıxışdırmanı aktivləşdir
he: הפעלת דחיסה בנסיגה בתיקיות

source: This setting enable compression in a recursive way in folders.
az: Bu parametr qovluqlarda rekursiv şəkildə sıxışdırmanı aktivləşdirir.
he: ההגדרה הזאת מפעילה דחיסה בצורה נסיגתית בתיקיות.

source: Preserve metadata
az: Metadatanı saxla
he: שימור נתוני העל

source: This setting preserves metadata of images.
az: Bu parametr şəkillərin metadatasını saxlayır.
he: ההגדרה הזאת משמרת את נתוני העל של תמונות.

source: Preserve file permissions and timestamps if possible
az: Mümkünsə fayl icazələrini və zaman damğalarını saxla
he: לשמר הרשאות וחותמות זמן של הקובץ אם ניתן

source: This setting file permissions and timestamps of images if possible.
az: Bu parametr mümkünsə şəkillərin fayl icazələrini və zaman damğalarını saxlayır.
he: ההגדרה הזאת שומרת על הרשאות וחותמת הזמן של קובצי התמונות אם ניתן.

source: Enable lossy mode
az: İtkili rejimi aktivləşdir
he: לאפשר מצב הפחתת איכות

source: Use lossy mode to compress images.
az: Şəkilləri sıxışdırmaq üçün itkili rejimdən istifadə edin.
he: להשתמש במצב אובדן איכות כדי לדחוס תמונות.

source: Suffix/Prefix to append at new file
az: Yeni faylda əlavə ediləcək suffiks/prefiks
he: סיומת/קידומת להוספה לקבצים חדשים

source: Suffix/Prefix to append at new file.
az: Yeni faylda əlavə ediləcək suffiks/prefiks.
he: סיומת/קידומת להוספה לקבצים חדשים.

source: PNG Lossy Compression Level
az: PNG İtkili Sıxışdırma Səviyyəsi
he: רמת דחיסת אובדן איכות PNG

source: Lossy compression level to use for PNG images.
az: PNG şəkilləri üçün istifadə ediləcək itkili sıxışdırma səviyyəsi.
he: רמת דחיסה עם אובדן איכות לשימוש לתמונות PNG.

source: PNG Lossless Compression Level
az: PNG İtkisiz Sıxışdırma Səviyyəsi
he: רמת דחיסה ללא אובדן איכות PNG

source: Lossless compression level to use for PNG images.
az: PNG şəkilləri üçün istifadə ediləcək itkisiz sıxışdırma səviyyəsi.
he: רמת דחיסה ללא אובדן איכות לשימוש לתמונות PNG.

source: JPG Lossy Compression Level
az: JPG İtkili Sıxışdırma Səviyyəsi
he: רמת דחיסת אובדן איכות JPG

source: Lossy compression level to use for JPG images.
az: JPG şəkilləri üçün istifadə ediləcək itkili sıxışdırma səviyyəsi.
he: רמת דחיסה עם אובדן איכות לשימוש לתמונות JPG.

source: WebP Lossy Compression Level
az: WebP İtkili Sıxışdırma Səviyyəsi
he: רמת דחיסת אובדן איכות WebP

source: Lossy compression level to use for WebP images.
az: WebP şəkilləri üçün istifadə ediləcək itkili sıxışdırma səviyyəsi.
he: רמת דחיסה עם אובדן איכות לשימוש לתמונות WebP.

source: WebP Lossless Compression Level
az: WebP İtkisiz Sıxışdırma Səviyyəsi
he: רמת דחיסה ללא אובדן איכות WebP

source: Lossless compression level to use for WebP images.
az: WebP şəkilləri üçün istifadə ediləcək itkisiz sıxışdırma səviyyəsi.
he: רמת דחיסה ללא אובדן איכות לשימוש לתמונות WebP.

source: Enable progressive encoding for JPEG images
az: JPEG şəkilləri üçün mütərəqqi kodlaşdırmanı aktivləşdir
he: הפעלת קידוד בשלבים לתמונות JPEG

source: Optionally encode jpeg images progressively.
az: JPEG şəkillərini opsional olaraq mütərəqqi şəkildə kodlaşdır.
he: לקודד תמונות jpen בשלבים כרשות.

source: Enable maximum compression for SVG images
az: SVG şəkilləri üçün maksimum sıxışdırmanı aktivləşdir
he: הפעלת דחיסה מרבית לתמונות SVG

source: Enable maximum cleaning of SVG images.
az: SVG şəkilləri üçün maksimum təmizləməni aktivləşdir.
he: הפעלת ניקוי מרבי של תמונות SVG.

source: Compression Timeout
az: Sıxışdırma Vaxtı Bitməsi
he: תום זמן שהוקצב לדחיסה

source: Compression timeout for each image.
az: Hər şəkil üçün sıxışdırma vaxtı bitməsi.
he: תום זמן שהוקצב לדחיסה עבור תמונה.

# shortcut window
source: General
az: Ümumi
he: כללי

# shortcut window
source: Select File
az: Fayl Seç
he: בחירת קובץ

# shortcut window
source: Preferences
az: Tərcihlər
he: העדפות

# shortcut window
source: Keyboard Shortcuts
az: Klaviatura Qısayolları
he: קיצורי מקלדת

# shortcut window
source: Quit
az: Çıx
he: יציאה

source: Preferences
az: Tərcihlər
he: העדפות

source: General
az: Ümumi
he: כללי

source: Safe Mode
az: Təhlükəsiz Rejim
he: מצב בטוח

source: Save the compressed image in a new file
az: Sıxışdırılmış şəkli yeni fayla saxla
he: שמירת הקובץ הדחוס בקובץ חדש

source: Naming Mode
az: Adlandırma Rejimi
he: מצב שיום

source: Select between suffix and prefix
az: Suffiks və prefiks arasında seçim edin
he: בחירה בין סיומת לקידומת

source: Suffix
az: Suffiks
he: סיומת

source: Prefix
az: Prefiks
he: קידומת

source: New File Suffix/Prefix
az: Yeni Fayl Suffiksi/Prefiksi
he: סיומת/קידומת לקובץ חדש

source: Recursive Compression
az: Rekursiv Sıxışdırma
he: דחיסה בנסיגה

source: Enable or disable compression through subdirectories
az: Alt qovluqlarda sıxışdırmanı aktivləşdir və ya deaktivləşdir
he: הפעלה או כיבוי של דחיסה על פני תת־תיקיות

source: Keep Metadata
az: Metadatanı Saxla
he: לשמור על נתוני העל

source: Keep metadata chunks that do not affect rendering
az: Görüntüləməyə təsir etməyən metadata parçalarını saxla
he: לשמור על חתיכות נתוני על שלא משפיעות על העיבוד

source: Keep File Attributes When Possible
az: Mümkünsə Fayl Atributlarını Saxla
he: לשמור על מאפייני הקובץ כשניתן

source: Ensure the new file has the same permissions and timestamps as the original file
az: Yeni faylın orijinal fayl ilə eyni icazələrə və zaman damğalarına sahib olmasını təmin edin
he: לוודא שלקובץ החדש יש את אותן ההרשאות וחותמת הזמן כמו הקובץ המקורי

source: Set the timeout between images
az: Şəkillər arasında vaxt bitməsini təyin edin
he: הגדרת תום זמן ההמתנה בין תמונות

source: Formats
az: Formatlar
he: תסדירים

source: Lossy Compression
az: İtkili Sıxışdırma
he: דחיסת אובדן איכות

source: Set the quality of the generated image, 100 is the best quality
az: Yaradılan şəklin keyfiyyətini təyin edin, 100 ən yaxşı keyfiyyətdir
he: הגדרת איכות התמונה שנוצרת, 100 היא האיכות הטובה ביותר

source: Lossless Compression Level
az: İtkisiz Sıxışdırma Səviyyəsi
he: רמת דחיסה ללא אובדן איכות

source: Set the level of the compression, 6 is the highest but slowest level
az: Sıxışdırma səviyyəsini təyin edin, 6 ən yüksək, lakin ən yavaş səviyyədir
he: הגדרת רמת הדחיסה, 6 היא הרמה הגבוהה אך האיטית ביותר

source: Progressive Encode
az: Mütərəqqi Kodlaşdırma
he: קידוד בשלבים

source: Enable incremental image rendering, going from blurry to clear
az: Şəklin tədricən, bulanıqdan aydınlığa keçən görüntülənməsini aktivləşdir
he: הפעלת עיבוד תמונה בשלבים, ממטושטש ועד ברור

source: Maximum Compression Level
az: Maksimum Sıxışdırma Səviyyəsi
he: רמת הדחיסה המרבית

source: This can be more destructive for the image
az: Bu, şəkil üçün daha çox zərərli ola bilər
he: זה יכול להיות יותר הרסני לתמונות

source: Bulk Compress Directory
az: Qovluğu Toplu Sıxışdır
he: דחיסת תיקייה במרוכז

source: Keyboard Shortcuts
az: Klaviatura Qısayolları
he: קיצורי מקלדת

source: About Curtail
az: Curtail Haqqında
he: על Curtail

source: Browse Files
az: Fayllara Bax
he: עיון בקבצים

source: Clear Results
az: Nəticələri Təmizlə
he: פינוי התוצאות

source: Main Menu
az: Əsas Menyu
he: תפריט ראשי

source: _Change Mode
az: Rejimi _Dəyiş
he: ה_חלפת מצב

source: Images will be overwritten, proceed carefully
az: Şəkillər üzərinə yazılacaq, diqqətlə davam edin
he: התמונות תידרסנה, נא להמשיך בזהירות

source: Drop images here to compress them
az: Şəkilləri sıxışdırmaq üçün bura atın
he: יש לגרור תמונות לכאן כדי לדחוס אותן

source: _Browse Files
az: _Fayllara Bax
he: _עיון בקבצים

source: Lossless
az: İtkisiz
he: ללא אובדן איכות

source: Lossy
az: İtkili
he: עם אובדן איכות

source: Compression has reached the configured timeout of {} seconds.
az: Sıxışdırma {} saniyəlik təyin edilmiş vaxt limitinə çatdı.
he: הדחיסה נמשכה עד זמן הסיום המוגדר על סך {} שניות.

source: An unknown error has occurred
az: Bilinməyən bir xəta baş verdi
he: אירעה שגיאה בלתי ידועה

source: Can't find the compressed file
az: Sıxışdırılmış fayl tapılmadı
he: לא ניתן למצוא את הקובץ הדחוס

source: All images
az: Bütün şəkillər
he: כל התמונות

source: PNG images
az: PNG şəkilləri
he: תמונות PNG

source: JPEG images
az: JPEG şəkilləri
he: תמונות JPEG

source: WebP images
az: WebP şəkilləri
he: תמונות WebP

source: SVG images
az: SVG şəkilləri
he: תמונות SVG

source: Version not found
az: Versiya tapılmadı
he: הגרסה לא נמצאה

source: Skipped
az: Keçildi
he: נפסח

source: More Information
az: Ətraflı Məlumat
he: פרטים נוספים

source: Compression was skipped because compressing the file would have resulted in a larger file size.
az: Sıxışdırma keçildi, çünki faylı sıxışdırmaq daha böyük fayl ölçüsünə səbəb olardı.
he: הדחיסה נפסחה כיוון שדחיסת הקובץ הייתה גורמת להגדלת נפחו.

source: Open Image
az: Şəkli Aç
he: פתיחת תמונה

source: Show in Folder
az: Qovluqda Göstər
he: הצגה בתיקייה

source: Safe mode with “{suffix_prefix}” suffix
az: “{suffix_prefix}” suffiksi ilə təhlükəsiz rejim
he: מצב בטוח עם הסיומת „{suffix_prefix}”

source: Safe mode with “{suffix_prefix}” prefix
az: “{suffix_prefix}” prefiksi ilə təhlükəsiz rejim
he: מצב בטוח עם הקידומת „{suffix_prefix}”

source: Overwrite mode
az: Üzərinə yazma rejimi
he: מצב דריסה

source: Browse Directories
az: Qovluqlara Bax
he: עיון בתיקיות

source: Are you sure you want to compress images in these directories?
az: Bu qovluqlardakı şəkilləri sıxışdırmaq istədiyinizə əminsiniz?
he: לדחוס תמונות בתיקיות האלו?

source: All of the images in the directories selected and their subdirectories will be compressed. The original images will not be modified.
az: Seçilmiş qovluqlardakı və onların alt qovluqlarındakı bütün şəkillər sıxışdırılacaq. Orijinal şəkillər dəyişdirilməyəcək.
he: כל התמונות בתיקיות הנבחרות ותת־התיקיות שתחתן תידחסנה. התמונות המקוריות תישארנה כמו שהן.

source: All of the images in the directories selected and their subdirectories will be compressed and overwritten!
az: Seçilmiş qovluqlardakı və onların alt qovluqlarındakı bütün şəkillər sıxışdırılacaq və üzərinə yazılacaq!
he: כל התמונות בתיקיות הנבחרות ותת־התיקיות שתחתן תידחסנה ותשוכתבנה!

source: Cancel
az: Ləğv et
he: ביטול

source: Compress
az: Sıxışdır
he: דחיסה

source: No files found
az: Heç bir fayl tapılmadı
he: לא נמצאו קבצים

source: This file doesn't exist.
az: Bu fayl mövcud deyil.
he: הקובץ לא קיים.

source: Format of this file is not supported.
az: Bu faylın formatı dəstəklənmir.
he: תסדיר הקובץ הזה לא נתמך.

source: translator-credits
az: Ramal Rəhimov <jhonaluman@gmail.com>
he: ירון שהרבני <sh.yaron@gmail.com>

source: Contributors
az: İştirakçılar
he: מתנדבים
